{"config": {"name": "sequential_1", "layers": [{"config": {"batch_input_shape": [null, 7000, 310], "name": "masking_1", "dtype": "float32", "trainable": true, "mask_value": 0.0}, "class_name": "Masking"}, {"config": {"recurrent_dropout": 0.0, "name": "lstm_1", "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "recurrent_constraint": null, "implementation": 1, "units": 100, "go_backwards": false, "stateful": false, "bias_constraint": null, "trainable": true, "return_sequences": true, "dropout": 0.2, "kernel_constraint": null, "unroll": false, "return_state": false, "kernel_regularizer": null, "use_bias": true, "unit_forget_bias": true}, "class_name": "LSTM"}, {"config": {"layer": {"config": {"name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "units": 3, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null}, "class_name": "Dense"}, "name": "time_distributed_1", "trainable": true}, "class_name": "TimeDistributed"}, {"config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}]}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}